In [70]:
import pandas as pd
import numpy as np

pd.__version__

In [3]:
df = pd.read_csv('../data/gapminder.tsv', sep='\t')

In [4]:
df.shape   #Shape is an attribute

(1704, 6)

In [5]:
df.info()    #info() is  method

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 1704 entries, 0 to 1703
Data columns (total 6 columns):
 #   Column     Non-Null Count  Dtype
---  ------     --------------  -----
 0   country    1704 non-null   object
 1   continent  1704 non-null   object
 2   year       1704 non-null   int64
 3   lifeExp    1704 non-null   float64
 4   pop        1704 non-null   int64
 5   gdpPercap  1704 non-null   float64
dtypes: float64(2), int64(2), object(2)
memory usage: 80.0+ KB

In [6]:
df.head()

       country continent  year  lifeExp       pop   gdpPercap
0  Afghanistan      Asia  1952   28.801   8425333  779.445314
1  Afghanistan      Asia  1957   30.332   9240934  820.853030
2  Afghanistan      Asia  1962   31.997  10267083  853.100710
3  Afghanistan      Asia  1967   34.020  11537966  836.197138
4  Afghanistan      Asia  1972   36.088  13079460  739.981106

In [7]:
df.tail()

       country continent  year  lifeExp       pop   gdpPercap
1699  Zimbabwe    Africa  1987   62.351   9216418  706.157306
1700  Zimbabwe    Africa  1992   60.377  10704340  693.420786
1701  Zimbabwe    Africa  1997   46.809  11404948  792.449960
1702  Zimbabwe    Africa  2002   39.989  11926563  672.038623
1703  Zimbabwe    Africa  2007   43.487  12311143  469.709298

In [8]:
df.columns

Index(['country', 'continent', 'year', 'lifeExp', 'pop', 'gdpPercap'], dtype='object')

In [9]:
df.index

RangeIndex(start=0, stop=1704, step=1)

In [10]:
df.values # to get numpy arrays

array([['Afghanistan', 'Asia', 1952, 28.801, 8425333, 779.4453145],
       ['Afghanistan', 'Asia', 1957, 30.332, 9240934, 820.8530296],
       ['Afghanistan', 'Asia', 1962, 31.997, 10267083, 853.10071],
       ...,
       ['Zimbabwe', 'Africa', 1997, 46.809, 11404948, 792.4499603],
       ['Zimbabwe', 'Africa', 2002, 39.989, 11926563, 672.0386227],
       ['Zimbabwe', 'Africa', 2007, 43.487, 12311143, 469.7092981]],
      dtype=object)

In [11]:
df.dtypes # to get datatypes for each column

country       object
continent     object
year           int64
lifeExp      float64
pop            int64
gdpPercap    float64
dtype: object

In [12]:
df.country

0       Afghanistan
1       Afghanistan
2       Afghanistan
3       Afghanistan
4       Afghanistan
           ...
1699       Zimbabwe
1700       Zimbabwe
1701       Zimbabwe
1702       Zimbabwe
1703       Zimbabwe
Name: country, Length: 1704, dtype: object

In [13]:
type(df.country)

pandas.core.series.Series

In [14]:
df_dropped = df.drop(['continent','country'],axis=1) # inplace=True

In [15]:
df_dropped

      year  lifeExp       pop   gdpPercap
0     1952   28.801   8425333  779.445314
1     1957   30.332   9240934  820.853030
2     1962   31.997  10267083  853.100710
3     1967   34.020  11537966  836.197138
4     1972   36.088  13079460  739.981106
...    ...      ...       ...         ...
1699  1987   62.351   9216418  706.157306
1700  1992   60.377  10704340  693.420786
1701  1997   46.809  11404948  792.449960
1702  2002   39.989  11926563  672.038623
1703  2007   43.487  12311143  469.709298

[1704 rows x 4 columns]

In [29]:
df.loc[0,["country","continent"]]

country      Afghanistan
continent           Asia
Name: 0, dtype: object

In [45]:
subset = df.iloc[:,[1,4]] #index based

In [46]:
subset

     continent       pop
0         Asia   8425333
1         Asia   9240934
2         Asia  10267083
3         Asia  11537966
4         Asia  13079460
...        ...       ...
1699    Africa   9216418
1700    Africa  10704340
1701    Africa  11404948
1702    Africa  11926563
1703    Africa  12311143

[1704 rows x 2 columns]

In [53]:
df.loc[(df["country"]=='India') & (df.year==2002)]

    country continent  year  lifeExp         pop    gdpPercap
706   India      Asia  2002   62.879  1034172547  1746.769454

In [74]:
df.groupby("year")["lifeExp"].agg([np.mean,np.max])

           mean     max
year
1952  49.057620  72.670
1957  51.507401  73.470
1962  53.609249  73.680
1967  55.678290  74.160
1972  57.647386  74.720
1977  59.570157  76.110
1982  61.533197  77.110
1987  63.212613  78.670
1992  64.160338  79.360
1997  65.014676  80.690
2002  65.694923  82.000
2007  67.007423  82.603

In [80]:
newdf = df.groupby(["year","continent"])[["lifeExp","gdpPercap"]].agg([np.mean,np.max]).reset_index

In [81]:
newdf

<bound method DataFrame.reset_index of                   lifeExp             gdpPercap
                     mean     max          mean            max
year continent
1952 Africa     39.135500  52.724   1252.572466    4725.295531
     Americas   53.279840  68.750   4079.062552   13990.482080
     Asia       46.314394  65.390   5195.484004  108382.352900
     Europe     64.408500  72.670   5661.057435   14734.232750
     Oceania    69.255000  69.390  10298.085650   10556.575660
1957 Africa     41.266346  58.089   1385.236062    5487.104219
     Americas   55.960280  69.960   4616.043733   14847.127120
     Asia       49.318544  67.840   5787.732940  113523.132900
     Europe     66.703067  73.470   6963.012816   17909.489730
     Oceania    70.295000  70.330  11598.522455   12247.395320
1962 Africa     43.319442  60.246   1598.078825    6757.030816
     Americas   58.398760  71.300   4901.541870   16173.145860
     Asia       51.563223  69.390   5729.369625   95458.111760
     Europe     68.539233  73.680   8365.486814   20431.092700
     Oceania    71.085000  71.240  12696.452430   13175.678000
1967 Africa     45.334538  61.557   2050.363801   18772.751690
     Americas   60.410920  72.130   5668.253496   19530.365570
     Asia       54.663640  71.430   5971.173374   80894.883260
     Europe     69.737600  74.160  10143.823757   22966.144320
     Oceania    71.310000  71.520  14495.021790   14526.124650
1972 Africa     47.450942  64.274   2339.615674   21011.497210
     Americas   62.394920  72.880   6491.334139   21806.035940
     Asia       57.319269  73.420   8187.468699  109347.867000
     Europe     70.775033  74.720  12479.575246   27195.113040
     Oceania    71.910000  71.930  16417.333380   16788.629480
1977 Africa     49.580423  67.064   2585.938508   21951.211760
     Americas   64.391560  74.210   7352.007126   24072.632130
     Asia       59.610556  75.380   7791.314020   59265.477140
     Europe     71.937767  76.110  14283.979110   26982.290520
     Oceania    72.855000  73.490  17283.957605   18334.197510
1982 Africa     51.592865  69.885   2481.592960   17364.275380
     Americas   66.228840  75.760   7506.737088   25009.559140
     Asia       62.617939  77.110   7434.135157   33693.175250
     Europe     72.806400  76.990  15617.896551   28397.715120
     Oceania    74.290000  74.740  18554.709840   19477.009280
1987 Africa     53.344788  71.913   2282.668991   11864.408440
     Americas   68.090720  76.860   7793.400261   29884.350410
     Asia       64.851182  78.670   7608.226508   28118.429980
     Europe     73.642167  77.410  17214.310727   31540.974800
     Oceania    75.320000  76.320  20448.040160   21888.889030
1992 Africa     53.629577  73.615   2281.810333   13522.157520
     Americas   69.568360  77.950   8044.934406   32003.932240
     Asia       66.537212  79.360   8639.690248   34932.919590
     Europe     74.440100  78.770  17061.568084   33965.661150
     Oceania    76.945000  77.560  20894.045885   23424.766830
1997 Africa     53.598269  74.772   2378.759555   14722.841880
     Americas   71.150480  78.610   8889.300863   35767.433030
     Asia       68.020515  80.690   9834.093295   40300.619960
     Europe     75.505167  79.390  19076.781802   41283.164330
     Oceania    78.190000  78.830  24024.175170   26997.936570
2002 Africa     53.325231  75.744   2599.385159   12521.713920
     Americas   72.422040  79.770   9287.677107   39097.099550
     Asia       69.233879  82.000  10174.090397   36023.105400
     Europe     76.700600  80.620  21711.732422   44683.975250
     Oceania    79.740000  80.370  26938.778040   30687.754730
2007 Africa     54.806038  76.442   3089.032605   13206.484520
     Americas   73.608120  80.653  11003.031625   42951.653090
     Asia       70.728485  82.603  12473.026870   47306.989780
     Europe     77.648600  81.757  25054.481636   49357.190170
     Oceania    80.719500  81.235  29810.188275   34435.367440>